Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/motor_tax_and_insurance/motor_insurance.html.txt.tmx
Source language: en
Languages: ga

source: The Insurance Information Service (IIS) is an information and complaints service operated by the Insurance Ireland, which many insurance companies in Ireland belong to
ga: Is seirbhís um fhaisnéis agus gearáin í an tSeirbhís um Árachas Faisnéise (IIS) atá faoi stiúr ag Éire Árachas, lena mbaineann go leor comhlachtaí árachais in Éirinn

source: Its purpose is to answer policyholders' questions and help them resolve problems
ga: Is é an cuspóir atá aici ceisteanna shealbhóirí polasaí a fhreagairt agus cabhrú leo fadhbanna a réiteach

source: It has no binding powers and complaints that cannot be resolved are generally referred to the Financial Services Ombudsman
ga: Níl aon chumhachtaí cealgaltacha aici agus is iondúil a n-atreoraítear gearáin nach féidir a réiteach chuig Ombudsman um Sheirbhísí Airgeadais

source: If you have been refused a quotation for motor insurance, you can email the Declined Cases Committee of Insurance Ireland who will help you obtain a motor insurance quotation
ga: Má diúltaíodh meastachán duit le haghaidh árachas mótair, Is féidir leat ríomhphost a sheoladh chuig Choiste na gCásanna Diúltaithe de Éire Árachas a bheidh ag cabhrú leat a fháil meastachán árachas mótair

source: The Motor Insurers Bureau of Ireland exists to compensate genuine victims of uninsured and untraced driving in Ireland
ga: Tá an Biúró Árachóirí Gluaisteán na hÉireann ann chun cúiteamh a thabhairt d'fhíor-íospartaigh tiomána gan árachas agus gan rianú in Éirinn

source: It fulfils a further European role to ensure claims arising from foreign motoring in Ireland or Irish motorists abroad are properly handled and settled
ga: Comhlíonann sí ról breise Eorpach chun a chinntiú go láimhseáiltear éilimh a eascraíonn as gluaisteánaíocht choigríochach in Éirinn nó tiománaithe Éireannacha thar lear i gceart agus go bhfuil siad socraithe
